FIQH_BOOKS = {
    6302: ["الفقه", "عام"],  # بلوغ المرام من أدلة الأحكام
    1067: ["الفقه", "حنفي"],  # الهداية في شرح بداية المبتدي
    1259: ["الفقه", "حنفي"],  # البحر الرائق شرح كنز الدقائق ومنحة الخال
    2706: ["الفقه", "حنفي"],  # الدر المختار وحاشية ابن عابدين  رد المحت
    4836: ["الفقه", "حنفي"],  # المبسوط للسرخسي
    5903: ["الفقه", "حنفي"],  # بدائع الصنائع في ترتيب الشرائع
    6375: ["الفقه", "حنفي"],  # الفرج بعد الشدة لابن أبي الدنيا
    1133: ["الفقه", "حنبلي"],  # الفروع وتصحيح الفروع
    2128: ["الفقه", "حنبلي"],  # الروض المربع شرح زاد المستقنع
    2489: ["الفقه", "حنبلي"],  # الإنصاف في معرفة الراجح من الخلاف ت التر offline
    2724: ["الفقه", "حنبلي"],  # كشاف القناع عن متن الإقناع
    2771: ["الفقه", "حنبلي"],  # الكافي في فقه الإمام أحمد
    29564: ["الفقه", "حنبلي"],  # الجامع لعلوم الإمام أحمد   الفقه
    5603: ["الفقه", "حنبلي"],  # الإقناع في فقه الإمام أحمد بن حنبل
    6024: ["الفقه", "حنبلي"],  # المغني لابن قدامة
    827: ["الفقه", "حنبلي"],  # عمدة الفقه
    114: ["الفقه", "مالكي"],  # مواهب الجليل في شرح مختصر خليل
    118: ["الفقه", "مالكي"],  # المدونة
    2222: ["الفقه", "مالكي"],  # الذخيرة للقرافي
    2778: ["الفقه", "مالكي"],  # البيان والتحصيل
    860: ["الفقه", "مالكي"],  # مختصر خليل
    2103: ["الفقه", "شافعي"],  # الأم للشافعي
    22536: ["الفقه", "شافعي"],  # روضة الطالبين  وعمدة المفتين
    2831: ["الفقه", "شافعي"],  # المجموع شرح المهذب
    6264: ["الفقه", "شافعي"],  # تحفة المحتاج في شرح المنهاج وحواشي الشرو
    6951: ["الفقه", "شافعي"],  # نهاية المطلب في دراية المذهب
    922: ["الفقه", "شافعي"],  # مغني المحتاج إلى معرفة معاني ألفاظ المنه
}

AQEEDAH_BOOKS = {
    102610: ["العقيدة", "أهل السنة والجماعة"],  # نظم العقيدة الطحاوية
    10857: ["العقيدة", "أهل السنة والجماعة"],  # العقيدة الواسطية
    1557: ["العقيدة", "أهل السنة والجماعة"],  # الشريعة للآجري
    2436: ["العقيدة", "أهل السنة والجماعة"],  # الفتوى الحموية الكبرى
    2555: ["العقيدة", "أهل السنة والجماعة"],  # معارج القبول بشرح سلم الوصول
    26750: ["العقيدة", "أهل السنة والجماعة"],  # منة الرحمن في نصيحة الأخوان
    2779: ["العقيدة", "أهل السنة والجماعة"],  # سلسلة الإيمان والكفر   المقدم
    2990: ["العقيدة", "أهل السنة والجماعة"],  # شرح العقيدة الطحاوية للبراك
    3136: ["العقيدة", "أهل السنة والجماعة"],  # فتح المجيد شرح كتاب التوحيد
    37973: ["العقيدة", "أهل السنة والجماعة"],  # متن العقيدة الطحاوية
    3847: ["العقيدة", "أهل السنة والجماعة"],  # أعلام السنة المنشورة لاعتقاد الطائفة الن
    3856: ["العقيدة", "أهل السنة والجماعة"],  # أصول الإيمان في ضوء الكتاب والسنة
    4320: ["العقيدة", "أهل السنة والجماعة"],  # عقيدة الولاء والبراء   المقدم
    472: ["العقيدة", "أهل السنة والجماعة"],  # شرح الطحاوية   ط دار السلام
    4791: ["العقيدة", "أهل السنة والجماعة"],  # عقيدة أهل السنة والجماعة للعثيمين
    54617: ["العقيدة", "أهل السنة والجماعة"],  # الجوهرة الفريدة في تحقيق العقيدة لأحمد ا
    6203: ["العقيدة", "أهل السنة والجماعة"],  # العقيدة الصحيحة وما يضادها
    62918: ["العقيدة", "أهل السنة والجماعة"],  # بدر التمام شرح لامية شيخ الإسلام
    6987: ["العقيدة", "أهل السنة والجماعة"],  # شرح كشف الشبهات ويليه شرح الأصول الستة
    830: ["العقيدة", "أهل السنة والجماعة"],  # التوحيد لابن عبد الوهاب
}

SEERAH_BOOKS = {
    6926: ["السيرة", "السيرة الشاملة"],  # الرحيق المختوم
    227: ["السيرة", "السيرة الشاملة"],  # السيرة النبوية لابن كثير
    2761: ["السيرة", "السيرة الشاملة"],  # زاد المعاد في هدي خير العباد
    3131: ["السيرة", "السيرة الشاملة"],  # سيرة ابن هشام ت السقا
    61126: ["السيرة", "الشمائل والصفات"],  # الشمائل المحمدية والخصائل المصطفوية
    5492: ["السيرة", "الشمائل والصفات"],  # مختصر الشمائل
    1507: ["السيرة", "الشمائل والصفات"],  # أخلاق النبي لأبي الشيخ الأصبهاني
    2288: ["السيرة", "الشمائل والصفات"],  # الشفا بتعريف حقوق المصطفى   وحاشية الشمن
    3094: ["السيرة", "المغازي والسرايا"],  # مغازي الواقدي
    6957: ["السيرة", "المغازي والسرايا"],  # سيرة ابن اسحاق   السير والمغازي
    5642: ["السيرة", "دلائل النبوة"],  # دلائل النبوة للبيهقي محققا
    489: ["السيرة", "دلائل النبوة"],  # دلائل النبوة لأبي نعيم الأصبهاني
    6858: ["السيرة", "دلائل النبوة"],  # أعلام النبوة للماوردي
    5294: ["السيرة", "الخصائص النبوية"],  # الخصائص الكبرى
    5292: ["السيرة", "الخصائص النبوية"],  # غاية السول في خصائص الرسول
    6842: ["السيرة", "جوامع السيرة"],  # جوامع السيرة ط العلمية
    6337: ["السيرة", "جوامع السيرة"],  # الفصول في السيرة
}


TAFSEER_BOOKS = {
    2556: ["التفسير", "التفسير بالمأثور"],  # تفسير القرطبي
    2799: ["التفسير", "التفسير بالمأثور"],  # تفسير عبد الرزاق الصنعاني
    2845: ["التفسير", "التفسير بالمأثور"],  # تفسير سفيان الثوري
    4738: ["التفسير", "التفسير بالدراية"],  # تفسير السعدي تيسير الكريم الرحمن
    5866: ["التفسير", "التفسير بالمأثور"],  # تفسير الطبري   جامع البيان ط هجر
    6026: ["التفسير", "التفسير بالمأثور"],  # تفسير ابن كثير ت سلامة
    1491: ["التفسير", "التفسير بالمأثور"],  # الدر المنثور في التفسير بالمأثور
    2410: ["التفسير", "التفسير بالمأثور"],  # المختصر في تفسير القرآن الكريم
    500033: ["التفسير", "التفسير بالمأثور",],  # معالم التنزيل في تفسير القرآن الكريم للبغوي
    500128: ["التفسير", "التفسير بالمأثور"],  # أيسر التفاسير لكلام العلي الكبير
    500035: ["التفسير", "التفسير بالمأثور",],  # المحرر الوجيز في تفسير الكتاب العزيز لابن عطية
    500040: ["التفسير", "التفسير بالمأثور"],  # زاد المسير في علم التفسير لابن الجوزي
    500054: ["التفسير", "التفسير بالدراية"],  # البحر المحيط لأبي حيان الأندلسي
    1484: ["التفسير", "التفسير بالدراية"],  # الجلالين للسيوطي
    3057: ["التفسير", "الجامع بين فني الرواية والدراية"],  # فتح القدير للإمام الشوكاني
    3037: ["التفسير", "الجامع بين فني الرواية والدراية"],  # بحر العلوم للسمرقندي
    # 500034: ["التفسير", "التفسير بالدراية"],  # الكشاف عن حقائق غوامض التنزيل للزمخشري
}

NAHW_SARF_BOOK = {
    96538: ["النحو والصرف", "صرف"],  # فتح الكريم اللطيف في شرح باكورة التعريف بالمهم من التصريف
    2858: ["النحو والصرف", "صرف"],  # الشافية في علم التصريف
    468: ["النحو والصرف", "صرف",],  # المنصف لابن جني، شرح كتاب التصريف لأبي عثمان المازني
    1027: ["النحو والصرف", "صرف"],  # شرح شافية ابن الحاجب - الرضي الأستراباذي
    6048: ["النحو والصرف", "نحو"],  # ألفية ابن مالك
    1069: ["النحو والصرف", "نحو"],  # أوضح المسالك إلي ألفية ابن مالك
    876: ["النحو والصرف", "نحو"],  # الآجرومية
    29707: ["النحو والصرف", "نحو"],  # الإنتصار لسيبويه علي المبرد
    5462: ["النحو والصرف", "نحو"],  # الجمل في النحو
    3076: ["النحو والصرف", "نحو"],  # العمدة في إعراب البردة قصيدة المبرد
    7022: ["النحو والصرف", "نحو"],  # الخصائص
    2971: ["النحو والصرف", "نحو"],  # الكتاب لسيبويه
    1250: ["النحو والصرف", "نحو"],  # الكافية في علم النحو
    90582: ["النحو والصرف", "نحو"],  # المسائل النحوية في كتاب التوضيح لشرح الجامع الصحيح
    253: ["النحو والصرف", "نحو"],  # النحو الواضح في قواعد اللغة العربية
    493: ["النحو والصرف", "نحو"],  # النحو الوافي
    4020: ["النحو والصرف", "نحو"],  # جامع الدروس العربية
    107516: ["النحو والصرف", "نحو"],  # شرح أبيات مغني اللبيب
    6982: ["النحو والصرف", "نحو"],  # شرح ابن عقيل على ألفية ابن مالك
    1022: ["النحو والصرف", "نحو"],  # شرح الأشمونى لألفية ابن مالك
    5465: ["النحو والصرف", "نحو"],  # شرح شذور الذهب لابن هشام
    6306: ["النحو والصرف", "نحو"],  # شرح شذور الذهب للجوجري
    5466: ["النحو والصرف", "نحو"],  # شرح قطر الندى وبل الصدى
    2325: ["النحو والصرف", "نحو"],  # شرح كتاب سيبويه للسيرافي
    4104: ["النحو والصرف", "نحو"],  # فتح رب البرية في شرح نظم الآجرومية
    44575: ["النحو والصرف", "نحو"],  # فوائت كتاب سيبويه
    6776: ["النحو والصرف", "نحو"],  # متن شذور الذهب
    5467: ["النحو والصرف", "نحو"],  # متن قطر الندى وبل الصدى
    5467: ["النحو والصرف", "نحو"],  # مغني اللبيب عن كتب الأعاريب
}

HISTORY_BOOKS = {
    # 1- التاريخ العام (الحوليات)
    6877:  ["التاريخ", "التاريخ العام",],  # تاريخ الطبري = تاريخ الرسل والملوك، وصلة تاريخ الطبري
    2760:  ["التاريخ", "التاريخ العام"],  # الكامل في التاريخ لابن الأثير
    3107:  ["التاريخ", "التاريخ العام"],  # البداية والنهاية ط الفكر
    1291:  ["التاريخ", "التاريخ العام"],  # تاريخ ابن خلدون
    1326:  ["التاريخ", "التاريخ العام"],  # المنتظم في تاريخ الملوك والأمم
    44586: ["التاريخ", "التاريخ العام"],  # مرآة الزمان في تواريخ الأعيان
    1319:  ["التاريخ", "التاريخ العام"],  # تاريخ الإسلام ت تدمري
   
    # 2- التراجم والطبقات
    # 2897: ["التاريخ", "التراجم والطبقات"],  # سير أعلام النبلاء ط الحديث
    662:  ["التاريخ", "التراجم والطبقات"],  # أسد الغابة في معرفة الصحابة
    1320: ["التاريخ", "التراجم والطبقات"],  # شذرات الذهب في أخبار من ذهب
    1091: ["التاريخ", "التراجم والطبقات"],  # تاريخ عجائب الآثار في التراجم والأخبار
    2139: ["التاريخ", "التراجم والطبقات"],  # الطبقات الكبري لابن سعد
   
    # 3- تواريخ المدن والبلدان
    5602: ["التاريخ", "تواريخ المدن والبلدان"],  # تاريخ بغداد للخطيب البغدادي
    3: ["التاريخ", "تواريخ المدن والبلدان"],  # تاريخ دمشق لابن عساكر
    980: ["التاريخ", "تواريخ المدن والبلدان"],  # المواعظ والاعتبار (الخطط المقريزية)
    6581: ["التاريخ", "تواريخ المدن والبلدان"],  # أخبار مكة للأزرقي
   
    # 4- كتب الأنساب والقبائل
    6886: ["التاريخ", "الأنساب والقبائل"],  # جمهرة أنساب العرب لابن حزم
    1289:  ["التاريخ", "الأنساب والقبائل"],  # الأنساب للسمعاني
    4948: ["التاريخ", "الأنساب والقبائل"],  # اللباب في تهذيب الأنساب لابن الأثير
   
    # 5- تاريخ الخلفاء
    1090:  ["التاريخ", "تاريخ الخلفاء"],  # تاريخ الخلفاء للسيوطي
    1322: ["التاريخ", "تاريخ الخلفاء"],  # الفخري في الآداب السلطانية لابن الطقطقا
   
    # 6- تاريخ الدول
    3208:  ["التاريخ", "تاريخ الدول"],  # إنباء الغمر بأبناء العمر
    1084: ["التاريخ", "تاريخ الدول"],  # النجوم الزاهرة في ملوك مصر والقاهرة لابن تغري بردي
    5335: ["التاريخ", "تاريخ الدول"],  # السلوك لمعرفة دول الملوك للمقريزي
    
    # 7- أخرى / ثقافة عامة
    11384: ["التاريخ", "ثقافة عامة وتاريخ"],  # رسالة في الطريق إلى ثقافتنا
}

HADITH_BOOKS = {
    # 1- المسانيد
    3161: ["الحديث", "المسانيد"],  # مسند الإمام أحمد بن حنبل
    # 10002: ["الحديث", "المسانيد"],  # مسند بقي بن مخلد
    54472: ["الحديث", "المسانيد"],  # مسند أبي بكر الحميدي
    54670: ["الحديث", "المسانيد"],  # مسند أبي يعلى الموصلي
    43953: ["الحديث", "المسانيد"],  # مسند البزار (البحر الزخار)
    103048: ["الحديث", "المسانيد"],  # مسند إسحاق بن راهويه
    6389: ["الحديث", "المسانيد"],  # مسند الإمام الشافعي
    1990: ["الحديث", "المسانيد"],  # مسند أبي داود الطيالسي
    1675: ["الحديث", "المسانيد"],  # مسند القضاعي
    486: ["الحديث", "المسانيد"],  # مسند عبد بن حميد
    16383: ["الحديث", "المسانيد"],  # مسند أبي عوانة
    2992: ["الحديث", "المسانيد"],  # مسند عبد الله بن المبارك
    1667: ["الحديث", "المسانيد"],  # مسند ابن أبي شيبة
    5359: ["الحديث", "المسانيد"],  # مسند أبي حنيفة رواية أبي نعيم

    # 2- المعجمات
    2237: ["الحديث", "المعجمات"],  # المعجم الكبير
    3479: ["الحديث", "المعجمات"],  # المعجم الأوسط
    1588: ["الحديث", "المعجمات"],  # المعجم الصغير
    20004: ["الحديث", "المعجمات"],  # المعجم المصنف لمؤلفات الحديث الشريف

    # 3- الموطآت والمصنفات
    1191907: ["الحديث", "الموطآت والمصنفات"],  # موطأ الإمام مالك
    1686: ["الحديث", "الموطآت والمصنفات"],  # مصنف عبد الرزاق
    6996: ["الحديث", "الموطآت والمصنفات"],  # مصنف ابن أبي شيبة

    # 4- الصحاح
    2130: ["الحديث", "الصحاح"],  # صحيح البخاري
    2229: ["الحديث", "الصحاح"],  # صحيح مسلم
    2230: ["الحديث", "الصحاح"],  # صحيح ابن حبان
    1956: ["الحديث", "الصحاح"],  # صحيح ابن خزيمة
    429: ["الحديث", "الصحاح"],  # المختارة (الأحاديث المختارة) للضياء المقدسي

    # 5- السنن
    2227: ["الحديث", "السنن"],  # سنن أبي داود
    57406: ["الحديث", "السنن"],  # سنن الترمذي
    1003020: ["الحديث", "السنن"],  # سنن النسائي
    1082: ["الحديث", "السنن"],  # سنن ابن ماجه
    2802: ["الحديث", "السنن"],  # سنن الدارمي
    6861: ["الحديث", "السنن"],  # سنن الدارقطني
    5882: ["الحديث", "السنن"],  # السنن الكبرى للبيهقي
    1638: ["الحديث", "السنن"],  # سنن سعيد بن منصور

    # 6- المستدركات
    2891: ["الحديث", "المستدركات"],  # المستدرك على الصحيحين للحاكم

    # 7- المستخرجات
    2709: ["الحديث", "المستخرجات"],  # مستخرج أبي عوانة على صحيح مسلم
    4876: ["الحديث", "المستخرجات"],  # مستخرج أبي نعيم على الصحيحين
    # 70003: ["الحديث", "المستخرجات"],  # مستخرج الإسماعيلي على صحيح البخاري

    # 8- المجامع (المصنفات الجامعة)
    # الطريقة الأولى: التصنيف على الأبواب
    3162: ["الحديث", "المجامع"],  # جامع الأصول من أحاديث الرسول لابن الأثير
    3384: ["الحديث", "المجامع"],  # كنز العمال في سنن الأقوال والأفعال للمتقي الهندي
    # الطريقة الثانية: ترتيب الأحاديث على أول كلمة فيها
    96933: ["الحديث", "المجامع"],  # الجامع الكبير (جمع الجوامع) للسيوطي
    38783: ["الحديث", "المجامع"],  # صحيح وضعيف الجامع الصغير
    3008: ["الحديث", "المجامع"],  # المقاصد الحسنة للسخاوي
    6080: ["الحديث", "المجامع"],  # كشف الخفاء ومزيل الإلباس للعجلوني

    # 9- التخريج والزوائد
    910: ["الحديث", "التخريج"],  # نصب الراية للزيلعي
    2652: ["الحديث", "التخريج"],  # المغني عن حمل الأسفار للعراقي
    2062: ["الحديث", "التخريج"],  # التلخيص الحبير لابن حجر

    # 10- الأطراف
    890: ["الحديث", "الأطراف"],  # تحفة الأشراف بمعرفة الأطراف للمزي
    # 100002: ["الحديث", "الأطراف"],  # ذخائر المواريث لعبد الغني النابلسي

    # 11- العلل والسؤالات
    43137: ["الحديث", "العلل والسؤالات"],  # العلل لابن أبي حاتم
    6279: ["الحديث", "العلل والسؤالات"],  # العلل الواردة في الأحاديث النبوية للدارقطني
    5069: ["الحديث", "العلل والسؤالات"],  # العلل لعلي بن المديني
    5072: ["الحديث", "العلل والسؤالات"],  # العلل ومعرفة الرجال للإمام أحمد
    1646: ["الحديث", "العلل والسؤالات"],  # علل الترمذي الكبير
    6468: ["الحديث", "العلل والسؤالات"],  # شرح علل الترمذي لابن رجب
    3185: ["الحديث", "العلل والسؤالات"],  # المنتخب من العلل للخلال
    106174: ["الحديث", "العلل والسؤالات"],  # التمييز للإمام مسلم
    230: ["الحديث", "العلل والسؤالات"],  # التاريخ الكبير للبخاري
    # 110011: ["الحديث", "العلل والسؤالات"],  # علل مسلم لابن عمار الشهيد
    # 110012: ["الحديث", "العلل والسؤالات"],  # الجامع لعلوم الإمام أحمد - علل الحديث
    # 110013: ["الحديث", "العلل والسؤالات"],  # سؤالات ابن أبي شيبة لابن المديني
    # 110014: ["الحديث", "العلل والسؤالات"],  # من كلام يحيى بن معين في الرجال
    # 110015: ["الحديث", "العلل والسؤالات"],  # الإلزامات والتتبع للدارقطني

    # 12- الضعيف
    1423: ["الحديث", "الضعيف"],  # سلسلة الأحاديث الضعيفة والموضوعة للألباني
    6123: ["الحديث", "الضعيف"],  # الضعفاء الصغير للبخاري
    568: ["الحديث", "الضعيف"],  # الضعفاء والمتروكون للنسائي
    2112: ["الحديث", "الضعيف"],  # ضعيف الجامع الصغير
    # 120005: ["الحديث", "الضعيف"],  # الكامل في ضعفاء الرجال لابن عدي
    # 120006: ["الحديث", "الضعيف"],  # المغني في الضعفاء للذهبي
    # 120007: ["الحديث", "الضعيف"],  # الضعفاء والمتروكون للدارقطني

    # 13- الموضوعة
    217: ["الحديث", "الموضوعة"],  # الموضوعات لابن الجوزي
    5082: ["الحديث", "الموضوعة"],  # اللآلئ المصنوعة للسيوطي
    130003: ["الحديث", "الموضوعة"],  # المنار المنيف لابن القيم

    # 14- مصطلح الحديث
    # المتون المختصرة
    11421: ["الحديث", "مصطلح الحديث"],  # النكت على البيقونية
    5018: ["الحديث", "مصطلح الحديث"],  # نخبة الفكر
    # 11421: ["الحديث", "مصطلح الحديث"],  # البيقونية
    # الكتب المتوسطة والمتقدمة
    5001: ["الحديث", "مصطلح الحديث"],  # ألفية العراقي
    4879: ["الحديث", "مصطلح الحديث"],  # التقريب والتيسير للنووي
    2938: ["الحديث", "مصطلح الحديث"],  # علوم الحديث (مقدمة ابن الصلاح)
    10819: ["الحديث", "مصطلح الحديث"],  # فتح المغيث للسخاوي
    1691: ["الحديث", "مصطلح الحديث"],  # معرفة علوم الحديث للحاكم
    # 140007: ["الحديث", "مصطلح الحديث"],  # الكفاية للخطيب البغدادي
    # 140008: ["الحديث", "مصطلح الحديث"],  # تدريب الراوي للسيوطي
    # 140009: ["الحديث", "مصطلح الحديث"],  # تيسير مصطلح الحديث لمحمود الطحان
    # 140010: ["الحديث", "مصطلح الحديث"],  # المحدث الفاصل بين الراوي والواعي
    # 140012: ["الحديث", "مصطلح الحديث"],  # المستخرج على معرفة علوم الحديث
    # 140013: ["الحديث", "مصطلح الحديث"],  # الجامع لأخلاق الراوي وآداب السامع
    # 140014: ["الحديث", "مصطلح الحديث"],  # الإلماع للقاضي عياض
    # 140015: ["الحديث", "مصطلح الحديث"],  # ما لا يسع المحدث جهله

    # 15- شروح الحديث
    # شروح صحيح البخاري
    1794: ["الحديث", "شروح الحديث"],  # فتح الباري
    4934: ["الحديث", "شروح الحديث"],  # عمدة القاري
    2897: ["الحديث", "شروح الحديث"],  # أعلام الحديث
    150003: ["الحديث", "شروح الحديث"],  # إرشاد الساري
    
    # شروح صحيح مسلم
    2211: ["الحديث", "شروح الحديث"],  # شرح النووي على مسلم
    96975: ["الحديث", "شروح الحديث"],  # المفهم لما أشكل من تلخيص مسلم
    
    # شروح السنن والمسانيد
    102859: ["الحديث", "شروح الحديث"],  # تحفة الأحوذي
    # 4936: ["الحديث", "شروح الحديث"],  # عون المعبود
    # 150009: ["الحديث", "شروح الحديث"],  # التمهيد
    # 150010: ["الحديث", "شروح الحديث"],  # الاستذكار
    # 150011: ["الحديث", "شروح الحديث"],  # شرح مسند الشافعي
    # 150012: ["الحديث", "شروح الحديث"],  # الجامع لعلوم الإمام أحمد - شرح الأحاديث والآثار
    # 150013: ["الحديث", "شروح الحديث"],  # تأويل مختلف الحديث
    # 150014: ["الحديث", "شروح الحديث"],  # المسائل والأجوبة لابن قتيبة
    # 150015: ["الحديث", "شروح الحديث"],  # فيض القدير
    
    # شروح أحاديث الأحكام
    2114: ["الحديث", "شروح الحديث"],  # إحكام الأحكام
    2687: ["الحديث", "شروح الحديث"],  # سبل السلام

    # 16- أحاديث الأحكام
    725: ["الحديث", "أحاديث الأحكام"],  # عمدة الأحكام
    6302: ["الحديث", "أحاديث الأحكام"],  # بلوغ المرام
    103075: ["الحديث", "أحاديث الأحكام"],  # منتقى الأخبار
    42141: ["الحديث", "أحاديث الأحكام"],  # تقريب الأسانيد وترتيب المسانيد
    91803: ["الحديث", "أحاديث الأحكام"],  # المحرر في الحديث لابن عبد الهادي

    # 17- الترغيب والترهيب
    5398: ["الحديث", "الترغيب والترهيب"],  # الترغيب والترهيب للمنذري
    2394: ["الحديث", "الترغيب والترهيب"],  # صحيح الترغيب والترهيب
    2205: ["الحديث", "الترغيب والترهيب"],  # ضعيف الترغيب والترهيب
    3024: ["الحديث", "الترغيب والترهيب"],  # رياض الصالحين
    63055: ["الحديث", "الترغيب والترهيب"],  # التخويف من النار لابن رجب
    # 170006: ["الحديث", "الترغيب والترهيب"],  # الترهيب من النار لابن أبي الدنيا
    # 170007: ["الحديث", "الترغيب والترهيب"],  # حسن الظن بالله لابن أبي الدنيا
}
